In [26]:
import pandas as pd
import numpy as np
import os
from scipy.stats import zscore
import matplotlib.pyplot as plt
import seaborn as sns

In [27]:
df = pd.read_csv("scores.csv")

In [28]:
df.head()

,number,days,gender,age,afftype,melanch,inpatient,edu,marriage,work,madrs1,madrs2
0,condition_1,11,2,35-39,2.0,2.0,2.0,6-10,1.0,2.0,19.0,19.0
1,condition_2,18,2,40-44,1.0,2.0,2.0,6-10,2.0,2.0,24.0,11.0
2,condition_3,13,1,45-49,2.0,2.0,2.0,6-10,2.0,2.0,24.0,25.0
3,condition_4,13,2,25-29,2.0,2.0,2.0,11-15,1.0,1.0,20.0,16.0
4,condition_5,13,2,50-54,2.0,2.0,2.0,11-15,2.0,2.0,26.0,26.0

In [29]:
df.shape #rows and columns

(55, 12)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   number     55 non-null     object
 1   days       55 non-null     int64
 2   gender     55 non-null     int64
 3   age        55 non-null     object
 4   afftype    23 non-null     float64
 5   melanch    20 non-null     float64
 6   inpatient  23 non-null     float64
 7   edu        53 non-null     object
 8   marriage   23 non-null     float64
 9   work       23 non-null     float64
 10  madrs1     23 non-null     float64
 11  madrs2     23 non-null     float64
dtypes: float64(7), int64(2), object(3)
memory usage: 5.3+ KB

In [31]:
df.isnull().sum()

number        0
days          0
gender        0
age           0
afftype      32
melanch      35
inpatient    32
edu           2
marriage     32
work         32
madrs1       32
madrs2       32
dtype: int64

In [32]:
df.columns

Index(['number', 'days', 'gender', 'age', 'afftype', 'melanch', 'inpatient',
       'edu', 'marriage', 'work', 'madrs1', 'madrs2'],
      dtype='object')

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   number     55 non-null     object
 1   days       55 non-null     int64
 2   gender     55 non-null     int64
 3   age        55 non-null     object
 4   afftype    23 non-null     float64
 5   melanch    20 non-null     float64
 6   inpatient  23 non-null     float64
 7   edu        53 non-null     object
 8   marriage   23 non-null     float64
 9   work       23 non-null     float64
 10  madrs1     23 non-null     float64
 11  madrs2     23 non-null     float64
dtypes: float64(7), int64(2), object(3)
memory usage: 5.3+ KB

In [34]:
df.describe()

,days,gender,afftype,melanch,inpatient,marriage,work,madrs1,madrs2
count,55.000000,55.000000,23.000000,20.000000,23.000000,23.000000,23.000000,23.000000,23.000000
mean,12.600000,1.454545,1.739130,1.950000,1.782609,1.521739,1.869565,22.739130,20.000000
std,2.491467,0.502519,0.540824,0.223607,0.421741,0.510754,0.344350,4.797892,4.729021
min,5.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,13.000000,11.000000
25%,13.000000,1.000000,1.000000,2.000000,2.000000,1.000000,2.000000,18.500000,16.000000
50%,13.000000,1.000000,2.000000,2.000000,2.000000,2.000000,2.000000,24.000000,21.000000
75%,13.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,26.000000,24.500000
max,20.000000,2.000000,3.000000,2.000000,2.000000,2.000000,2.000000,29.000000,28.000000

In [35]:
df.drop(['days','madrs2'], axis=1, inplace=True)

In [36]:
df.describe()

,gender,afftype,melanch,inpatient,marriage,work,madrs1
count,55.000000,23.000000,20.000000,23.000000,23.000000,23.000000,23.000000
mean,1.454545,1.739130,1.950000,1.782609,1.521739,1.869565,22.739130
std,0.502519,0.540824,0.223607,0.421741,0.510754,0.344350,4.797892
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,13.000000
25%,1.000000,1.000000,2.000000,2.000000,1.000000,2.000000,18.500000
50%,1.000000,2.000000,2.000000,2.000000,2.000000,2.000000,24.000000
75%,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,26.000000
max,2.000000,3.000000,2.000000,2.000000,2.000000,2.000000,29.000000

In [58]:
#sliced_df = df.loc['control_1':'control_32']

In [59]:
#df = df.drop(index=df.loc['control_1':'control_32'].index)

In [60]:
#df.tail(5)

,number,gender,age,afftype,melanch,inpatient,edu,marriage,work,madrs1
50,control_28,2,45-49,NaN,NaN,NaN,,NaN,NaN,NaN
51,control_29,2,50-54,NaN,NaN,NaN,,NaN,NaN,NaN
52,control_30,2,35-39,NaN,NaN,NaN,,NaN,NaN,NaN
53,control_31,1,20-24,NaN,NaN,NaN,,NaN,NaN,NaN
54,control_32,2,25-29,NaN,NaN,NaN,,NaN,NaN,NaN

In [62]:
df.drop(labels=range(23, 55), axis=0)

,number,gender,age,afftype,melanch,inpatient,edu,marriage,work,madrs1
0,condition_1,2,35-39,2.0,2.0,2.0,6-10,1.0,2.0,19.0
1,condition_2,2,40-44,1.0,2.0,2.0,6-10,2.0,2.0,24.0
2,condition_3,1,45-49,2.0,2.0,2.0,6-10,2.0,2.0,24.0
3,condition_4,2,25-29,2.0,2.0,2.0,11-15,1.0,1.0,20.0
4,condition_5,2,50-54,2.0,2.0,2.0,11-15,2.0,2.0,26.0
5,condition_6,1,35-39,2.0,2.0,2.0,6-10,1.0,2.0,18.0
6,condition_7,1,20-24,1.0,NaN,2.0,11-15,2.0,1.0,24.0
7,condition_8,2,25-29,2.0,NaN,2.0,11-15,1.0,2.0,20.0
8,condition_9,2,45-49,1.0,NaN,2.0,6-10,1.0,2.0,26.0
9,condition_10,2,45-49,2.0,2.0,2.0,6-10,1.0,2.0,28.0
10,condition_11,1,45-49,2.0,2.0,2.0,6-10,1.0,2.0,24.0
11,condition_12,2,40-44,1.0,2.0,2.0,6-10,2.0,2.0,25.0
12,condition_13,2,35-39,1.0,2.0,2.0,11-15,2.0,2.0,18.0
13,condition_14,1,60-64,1.0,2.0,2.0,6-10,2.0,2.0,28.0
14,condition_15,2,55-59,2.0,2.0,2.0,11-15,1.0,1.0,14.0
15,condition_16,1,45-49,2.0,2.0,2.0,11-15,1.0,2.0,13.0
16,condition_17,1,50-54,1.0,2.0,2.0,6-10,1.0,2.0,17.0
17,condition_18,2,40-44,3.0,2.0,2.0,11-15,2.0,2.0,18.0
18,condition_19,2,50-54,2.0,2.0,1.0,16-20,2.0,2.0,26.0
19,condition_20,1,30-34,2.0,1.0,1.0,6-10,1.0,2.0,27.0
20,condition_21,2,35-39,2.0,2.0,1.0,6-10,2.0,2.0,26.0
21,condition_22,1,65-69,2.0,2.0,1.0,,2.0,2.0,29.0
22,condition_23,1,30-34,2.0,2.0,1.0,16-20,2.0,2.0,29.0